tap "caskroom/cask"
tap "fisherman/tap"
tap "caskroom/fonts"

# Bash Completions
brew "bash-completion"
# brew "homebrew/completions/git-completion"
brew "https://raw.githubusercontent.com/kevinastone/homebrew-completions/2cabd27e396c7b924b8da361c9004064d00c5533/git-completion.rb"

# System Packages
brew "ssh-copy-id"
brew "htop"
brew "node"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "hub"
brew "jq"
brew "httpie"
brew "fish"
brew "fisherman"
brew "moreutils"
brew "grc"
brew "mosh"
brew "fpp"
brew "mas"

# Cask Apps
cask "alfred"
cask "hammerspoon"
cask "sublime-text"
cask "kap"
cask "paparazzi"
cask "vlc"
cask "keepingyouawake"
cask "rocket"
cask "font-fira-code"

# Mac App Store Apps
mas "1Password", id: 443987910
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
