tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Bash Completions
brew "bash-completion"

# System Packages
brew "ssh-copy-id"
brew "htop"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "httpie"
brew "fish"
brew "starship"
brew "moreutils"
brew "grc"
brew "yt-dlp"
brew "mas"

# Cask Apps
cask "alfred"
cask "hammerspoon"
cask "sublime-text"
cask "1password"
cask "spotify"
cask "vlc"
cask "keepingyouawake"
cask "font-fira-code"

# Mac App Store Apps
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "Affinity Designer", id: 824171161
